# Parameter Type Id Rebar Termination Rotation At End Schedules Tags Filters Property

Source: https://www.revitapidocs.com/2026/75a9c498-3c09-f868-31d7-7dcd8e9dd8a4.htm

---

| Parameter Type Id Rebar Termination Rotation At End Schedules Tags Filters Property |
| --- |

"Rotation At End"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId RebarTerminationRotationAtEndSchedulesTagsFilters { get; }
```

```
Public Shared ReadOnly Property RebarTerminationRotationAtEndSchedulesTagsFilters As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ RebarTerminationRotationAtEndSchedulesTagsFilters {
	ForgeTypeId^ get ();
}
```

```
static member RebarTerminationRotationAtEndSchedulesTagsFilters : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace